blog/2010/09/13/filetool-perfect-solution-vc6.0-incompatibility-issues-with-win7-[rpm]/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>filetool完美解决VC6.0与WIN7不兼容问题[转] - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>filetool完美解决VC6.0与WIN7不兼容问题[转]</h1>
  <p>
转自：<a href="http://alg.we2y.com/?p=65"><a href="http://alg.we2y.com/?p=65">http://alg.we2y.com/?p=65</a></a>
</p>

<p>
上次自己在google上搜到过一次，但是这次解决又花了我一个小时，郁闷 ，这次一定要记录下来，Fuck.
</p>

<p>
今天打开VC6.0突然出现一个问题，不能点击“打开”，一点打开就出现错误，然后VC自动关闭，重新安装还是不行，我是win7系统，于是就想到可能是和系统不兼容造成的，毕竟6.0还是xp之前出来的，十几年了，但是不用不行啊，用习惯了，虽然TC比VC标准，但是这么多年都是VC，哎，不得不说微软有多恐怖啊。。。。好了，于是就从这个下手，去微软官网找补丁，没想到还真有补丁，微软网站描述的问题和我遇到的一样：
</p>





<p>
Access Violation (0xC0000005) in DEVSHL.DLL at 0×5003eaed.
DevShl.Dll referenced memory at 0×0000000. The memory could not be read.
</p>





<p>
出现这个错误，他们提供一个补丁<a href="http://download.microsoft.com/download/vc60ent/s1/6.0/w9xnt4/en-us/filetool.exe">filetool</a>（点击直接下载），并提供解决步骤：
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">nstalling the Add-In</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Run FileTool.Exe to extract the Visual C++ 6.0 project.
</li>
<li>Build the project in Visual C++ in *Release* or *Debug* configuration.
</li>
<li>In Visual C++, click *Customize* from the *Tools* menu.
</li>
<li>In the *Customize* dialog box, click the *Add-Ins and Macro Files* tab.
</li>
<li>Click the *Browse* button and locate the FileTool.dll file that was built in step 2.
</li>
<li>Click *OK* to save the settings.
</li>
</ol>


<p>
按照直接翻译的步骤估计是弄不好，不知道老外是怎么思考问题的.....
</p>

<p>
1.首先将下载的filetool这个文件解压，要学好路径，选在桌面就行了；
</p>

<p>
2.用VC6.0的打开工作空间（注意，一般情况下是打开不能用，但是打开工作空间还是可以用的），打开刚才解压的文件里面的Filetool.dsw文件，然后编译，在debug文件夹里面会出现一个Filetool.dll的库文件（其实就是微软给了你源代码然后让你自己编译生成需要的东西，不知道微软为什么不直接提供dll文件，可能是跟用户具体软件配置有关吧）；
</p>

<p>
3.工具-&gt;定制-&gt;附加宏或宏文件选项卡，浏览，选择上一步生成的dll文件，然后打开，过上几秒钟这个宏就自动加进去了，然后关闭对话框，这时会看到界面上多了一个菜单条，A就是add file to project，O就是OPEN，代替原来相应的操作。
</p>
</div>
</div>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
